# Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

import math

N = int(input("Введите количество чисел после запятой "))
s = ''
P = math.pi
while N+1 > 0:
    s += str(int(P))
    P = (P - (int(P))) * 10
    N -= 1
print(s[:1]+'.'+s[1:])
